[
  {
    "address": "4829 Sisson Road",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1",
    "sqft": 1140,
    "price": "$182,500",
    "desc": " *** A Must See! *** This updated townhouse is centrally located to schools, shopping, medical & restaurants with easy access to 95. A long list of updates include: A new roof 2022, Updated Kitchen with new appliances and cabinets, New carpet upstairs, New fresh interior paint, all New Window Treatments, New European Wood Laminate Flooring in the living areas. A fenced courtyard for privacy for your outdoor activities and a great view of the rocket launches. A community pool to have some fun also.",
    "link": "https://www.flexmls.com/share/9tIBZ/4829-Sisson-Road-Titusville-FL-32780",
    "image": "img/4829-Sisson-Rd.jpg"
   },
   {
   "address": "2721 Riviera Drive",
    "city": "Titusville",
    "bedrooms": "4",
    "bathrooms": "2",
    "sqft": 1766,
    "price": "$292,000",
    "desc": "This spacious home is located in a desirable neighborhood and offers the ideal blend of comfort, convenience, and entertainment possibilities. This 4-bedroom, 2-bathroom home is situated on a spacious lot with a two-car garage, and extra wide driveway. As you step inside, you will be greeted by a cozy living space that exudes warmth and character. This cozy home features a practical layout that provides ample space for a growing family and/or guests. In addition to the cozy living area, the home also features a formal living room, perfect for hosting guests or enjoying quiet evenings with loved ones. The home also features custom shelving throughout for more storage. The heart of the home is the well-appointed kitchen, a chef's paradise boasting durable Corian countertops, (some) stainless-steel appliances, lots of cabinet space, and a small custom bar area, ideal for hosting gatherings or enjoying casual meals with loved ones. There is a breakfast nook next to the kitchen with sliding doors that open up to the screened porch that you can enjoy year-round. Outside, youll find a spacious fenced-in backyard, complete with a storage shed, offering plenty of room for outdoor activities, gardening, or simply relaxing in the shade. The roof was replaced in 2010, HVAC 2020. This home also has hurricane shutters. Located near shopping, dining, parks, entertainment, and top-rated schools",
    "link": "https://www.flexmls.com/share/A2p5Z/2721-Riviera-Drive-Titusville-FL-32780",
    "image": "img/2721-Riviera.jpg"
  },
{
   "address": "190 E. Olmstead Drive #11",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "2",
    "sqft": 1023,
    "price": "$228,320",
    "desc": "Perfect home in the sun with Indian River frontage to the east overlooking the pool. Great for investor, contact agent for details/ appointment. Breath taking Indian River view from covered balcony/porch of the launches. Living room/ dining room combo, pass through to the kitchen, butcher block countertop with polyacrylic seal, new laminate flooring bathrooms and kitchen, rest unit is carpet, raised ceilings in the bathroom, ac 2-3yrs, carpet 1yr, hurricane windows and plumbing 1-2 yrs redone by the association from outside access to the unit. Whether you are watching the space launches, enjoying the community pool, or fishing from the community dock, this unit is a must see.",
    "link": "https://www.flexmls.com/share/A2pTX/190-E-Olmstead-Drive-11-Titusville-FL-32780",
    "image": "img/190-Olmstead.jpg"
},
  {
   "address": "2510 Longwood Court",
    "city": "Titusville",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 1602,
    "price": "$425,000",
    "desc": "Check out this beautifully maintained 3 bedroom, 2 bath home with 2-car garage and screen enclosed pool. This home offers a roof done in 2021, hurricane shutters, hot water replaced in 2017 and has 9 1/2 ft ceilings throughout. If you work at the Space Center this house is only 14 miles to the industrial area of KSC. Close to shopping, I-95 and US-1. House also offers an extra driveway/RV pad behind the house with electric hookup.",
    "link": "https://www.flexmls.com/share/A3i4O/2510-Longwood-Court-Titusville-FL-32780",
    "image": "img/2510-Longwood.jpg"
},
  {
   "address": "1654 South Park Avenue",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "2",
    "sqft": 1332,
    "price": "$199,000",
    "desc": "Welcome to Tennis Village! This 2-bedroom 21/2-bathroom two story townhouse has community pool and tennis court along with lower-level courtyard, and 2nd level balcony. Inside you will find an open floor plan with eat in kitchen and breakfast bar, living room with wood burning fireplace, a half bath with laundry, and sliders to access the courtyard from the dining and living areas. The second floor you will find the master bedroom with ensuite bath, guest bedroom with the guest bath and nice storage space. Main roof installed 6/2020. All of this conveniently located near the Indian River Lagoon on the Space Coast with easy access to major highways, beaches, shopping and medical. Dont miss this great opportunity!",
    "link": "https://www.flexmls.com/share/A6PvK/1654-S-Park-Avenue-Titusville-FL-32780",
    "image": "img/1654-Park.jpg"
},
  {
   "address": "3726 Neverland Drive",
    "city": "New Smyrna Beach",
    "bedrooms": "4",
    "bathrooms": "3",
    "sqft": 2681,
    "price": "$505,000",
    "desc": "This beautiful 4 bedroom, 2 full baths, 1 half bath home is located on a corner lot in the desirable Coastal Woods subdivision. On the main floor you will find the kitchen, dining room, bonus/flex room, living room, and half bath. On the second floor you will find four bedrooms, two full baths, the laundry room, attic access and a large loft. The master bath includes double sinks, a private toilet, shower, a large walk-in closet and a linen closet. The spare bath contains double sinks and a tub/shower. This home offers tile floors downstairs, pet and waterproof carpet upstairs (installed 2022), various automatic and dimmer lights downstairs, lots of storage space on both floors, kitchen with tiled back splash, walk-in pantry, and a large island. Home has a fresh air ventilation system (AprilAire Home). The backyard is fully fenced with white vinyl fencing which has a double gate on the south side. The backyard also contains a 50-amp generator hookup, a covered porch and an open area, both with pavers. The gazebo conveys as well! The HOA fee includes community maintenance, the community pool and playgrounds.",
    "link": "https://www.flexmls.com/share/ABRQe/2736-Neverland-Drive-New-Smyrna-Beach-FL-32168",
    "image": "img/2736-Neverland.jpg"
},
   {
   "address": "817 Oakwood Drive",
    "city": "Melbourne",
    "bedrooms": "2",
    "bathrooms": "2",
    "sqft": 1842,
    "price": "$375,000",
    "desc": "Spacious one-story villa in the desirable Briarwood at Suntree, which offers a community pool with bathrooms, a water fountain, a covered patio, chase loungers and umbrellas. Being a resident, you are allowed to join Suntree's HOA (additional fees) that offers 36 holes of Championship golf, a state-of-the-art short game practice facility, 8 lighted tennis courts and a club house! Roof is 2 years new! You will enter this home through a large, tiled courtyard. This home has an open floor plan with two large bedrooms, two full bathrooms, a two-car garage, kitchen with a breakfast nook & plenty of cabinet and countertop space, an indoor laundry with plenty of cabinets for storage, living room, dining room & a family/florida room, multiple skylights that allow for natural light throughout, multiple storage closets, hurricane shutters & a sprinkler system. The large master bedroom has a walk-in closet & an additional closet.The master bathroom has a tub & separate shower, double sinks & a large linen closet. This home is located near shopping, dining, banking, healthcare, schools, entertainment, vehicle care & much more. HOA covers roof replacement, insurance, exterior maintenance, lake/irrigation maintenance, community pool, pest control & termite bond.",
    "link": "https://www.flexmls.com/share/ABReJ/817-Oakwood-Drive-Melbourne-FL-32940",
    "image": "img/817-Oakwood.jpg"
    {
   "address": "3620 Buttonwood Drive",
    "city": "Titusville",
    "bedrooms": "4",
    "bathrooms": "3",
    "sqft": 1923,
    "price": "$425,000",
    "desc": "Beacon Hills tri-level with BASEMENT at the end of a cul-de-sac! This 4 bedroom 2.5 bathroom on almost 1/2 acre has endless possibilities! You will enter this home through the double door entry to find the living, dining and kitchen area. Upstairs will encompass the spacious master suite with his/hers closet, renovated bathroom with walk in shower, 2 guest bedrooms, renovated guest bathroom, and two storage closets. On the bottom floor you will find a private bedroom with ensuite half bath and sliders out to the patio. The two-car garage provides ample room for your cars, toys, and/or storage. Then as a bonus, there is a 400+ sq ft basement (not included on the tax roll) just waiting for some creative ideas for playroom, man cave, craft room, or whatever you may need extra space for. Back yard has chicken coop already in place so you can gather those fresh eggs! Newer roof and HVAC system. What are you waiting for, call now!",
    "link": "https://www.flexmls.com/share/AGN4f/3620-Buttonwood-Drive-Titusville-FL-32796",
    "image": "img/3620-Buttonwood.jpg"
},
    {
   "address": "4847 Horton Street",
    "city": "Cocoa",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 1118,
    "price": "$299,999",
    "desc": "This is the one you've been waiting for! MOTIVATED SELLER! Lot of upgrades in this 3 bed 2 bath 2 car garage Port St John home. Large privacy fenced back yard with workshop that has power. Oversized garage has a Mini split AC system for temperature control, and exterior vinyl sliding doors in place. The split floor plan has ceramic tile floors throughout with custom baseboards and freshly painted interior. Kitchen has stainless appliances with separate dining area, and living room has nice bay window. Master suite has his/hers closets, built in floor safe, and upgraded bath to include walk-in shower. Additional concrete slab in back yard to be creative with. Roof 2018 HVAC 2020. Washer/Dryer convey.",
    "link": "https://www.flexmls.com/share/AGNCB/4847-Horton-Street-Cocoa-FL-32927",
    "image": "img/4847-Horton.jpg"
},
    {
   "address": "6485 Greenwood Avenue",
    "city": "Cocoa",
    "bedrooms": "2",
    "bathrooms": "2",
    "sqft": 1014,
    "price": "$275,000",
    "desc": "Watch the next rocket launch from your new backyard! This freshly painted 2 bedroom 2 bathroom home with additional bonus room is looking for its new owners. This floorplan features an eat-in kitchen, living room, enclosed Florida room, additional storage room under air, and wood flooring throughout. 1 car garage with laundry area & additional space. Nice sized fenced backyard equipped with 2 sheds for storage, 1 with electric. Washer/dryer, garage refrigerator, & mini refrigerator all convey. Roof 2015, AC 2018, and septic tank pumped last month. Don't miss your opportunity to take advantage of all this home has to offer!",
    "link": "https://www.flexmls.com/share/AGNKQ/6485-Greenwood-Avenue-Cocoa-FL-32927",
    "image": "img/6485-Greenwood.jpg"
},
  ]
