[
  {
    "address": "4829 Sisson Road",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1",
    "sqft": 1140,
    "price": "$182,500",
    "desc": " *** A Must See! *** This updated townhouse is centrally located to schools, shopping, medical & restaurants with easy access to 95. A long list of updates include: A new roof 2022, Updated Kitchen with new appliances and cabinets, New carpet upstairs, New fresh interior paint, all New Window Treatments, New European Wood Laminate Flooring in the living areas. A fenced courtyard for privacy for your outdoor activities and a great view of the rocket launches. A community pool to have some fun also.",
    "link": "https://www.flexmls.com/share/9tIBZ/4829-Sisson-Road-Titusville-FL-32780",
    "image": "img/4829-Sisson-Rd.jpg"
   },
  {
     "address": "4875 Sisson Road",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1",
    "sqft": 1140,
    "price": "$170,000",
    "desc": " Recently Renovated 2 story 2 bed 11/2 bath townhouse with privacy fenced back yard area. Dining area, galley kitchen and living room along with 1/2 bath located on the first level. Kitchen has stainless appliances and granite countertops. Ceramic tile throughout downstairs, carpet throughout upstairs. 2nd level includes Master bedroom with his/hers closets, inside laundry hook up, guest bedroom and guest bath with Granite top. Community pool, lawn maintenance and basic cable included in the very low monthly assoc. fee. Roof 3 yrs, HVAC 1 year. Great location for easy commute to Kennedy Space Center, Orlando, and beaches. Just minutes to major highways.",
    "link": "https://www.flexmls.com/share/9szdZ/4875-Sisson-Road-Titusville-FL-32780",
    "image": "img/4875-Sisson-rd.jpg"
  },
  {
   "address": "3019 Finsterwald Drive",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "2",
    "sqft": 1476,
    "price": "$214,500",
    "desc": " Impeccable 2nd floor updated condo located on a cul de sac in a desirable location in Titusville. The condo unit offers contemporary ease & convenience that builds a lifestyle of relaxation set within a safe & tranquil neighborhood. The home has 2 spacious bedrooms,2 baths with a walk in closet in the master. Enjoy preparing your food in the custom upgraded granite kitchen with stainless steel appliances - enough space for a small table or office with window & balcony. A dining room & living room open up with views of green space. Sit by the fireplace during the colder days. Master bathroom upgraded with new cabinets & beautiful granite. A one car garage is included giving plenty of space and additional storage. Watch rocket launches from your front door! Newer Roof. Updates since 2018 - new garage door opener, new outdoor entrance lights, new carpeting in master & hallways, fresh interior paint, New light fixtures, blinds, fans, toilets and bathroom hardware. Close to everything!",
    "link": "https://www.flexmls.com/share/9u6nK/3019-Finsterwald-Drive-Titusville-FL-32780",
    "image": "img/3019-Finsterwald.jpg"
  }, 
  {
   "address": "5140 Fruitport Street",
    "city": "Cocoa",
    "bedrooms": "4",
    "bathrooms": "2",
    "sqft": 1997,
    "price": "$349,900",
    "desc": "Impeccable home offering contemporary ease and convenience. Set within a safe and tranquil neighborhood., close to schools, shopping, medical with easy access to the interstate. This house has 4 spacious bedrooms, 2 baths and a walk-in closet in the master. Enjoy preparing your food in the sleek kitchen with granite counters, new cabinets, an island for extra cooking space and a bar with stools to sit at. Roof is a 2016, new water heater, new refrigerator. Relax in your screened porch with a view of your private retreat- your backyard. with a storage shed & irrigation system. Extra circuit panel in garage for hobbies. So hurry as your home awaits you!",
    "link": "https://www.flexmls.com/share/A2okB/5140-Fruitport-Street-Cocoa-FL-32927",
    "image": "img/5140-Fruitport.jpg"
  },
   {
   "address": "2721 Riviera Drive",
    "city": "Titusville",
    "bedrooms": "4",
    "bathrooms": "2",
    "sqft": 1766,
    "price": "$292,000",
    "desc": "This spacious home is located in a desirable neighborhood and offers the ideal blend of comfort, convenience, and entertainment possibilities. This 4-bedroom, 2-bathroom home is situated on a spacious lot with a two-car garage, and extra wide driveway. As you step inside, you will be greeted by a cozy living space that exudes warmth and character. This cozy home features a practical layout that provides ample space for a growing family and/or guests. In addition to the cozy living area, the home also features a formal living room, perfect for hosting guests or enjoying quiet evenings with loved ones. The home also features custom shelving throughout for more storage. The heart of the home is the well-appointed kitchen, a chef's paradise boasting durable Corian countertops, (some) stainless-steel appliances, lots of cabinet space, and a small custom bar area, ideal for hosting gatherings or enjoying casual meals with loved ones. There is a breakfast nook next to the kitchen with sliding doors that open up to the screened porch that you can enjoy year-round. Outside, youll find a spacious fenced-in backyard, complete with a storage shed, offering plenty of room for outdoor activities, gardening, or simply relaxing in the shade. The roof was replaced in 2010, HVAC 2020. This home also has hurricane shutters. Located near shopping, dining, parks, entertainment, and top-rated schools",
    "link": "https://www.flexmls.com/share/A2p5Z/2721-Riviera-Drive-Titusville-FL-32780",
    "image": "img/2721-Riviera.jpg"
  },
{
   "address": "190 E. Olmstead Drive #11",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "2",
    "sqft": 1023,
    "price": "$228,320",
    "desc": "Perfect home in the sun with Indian River frontage to the east overlooking the pool. Great for investor, contact agent for details/ appointment. Breath taking Indian River view from covered balcony/porch of the launches. Living room/ dining room combo, pass through to the kitchen, butcher block countertop with polyacrylic seal, new laminate flooring bathrooms and kitchen, rest unit is carpet, raised ceilings in the bathroom, ac 2-3yrs, carpet 1yr, hurricane windows and plumbing 1-2 yrs redone by the association from outside access to the unit. Whether you are watching the space launches, enjoying the community pool, or fishing from the community dock, this unit is a must see.",
    "link": "https://www.flexmls.com/share/A2pTX/190-E-Olmstead-Drive-11-Titusville-FL-32780",
    "image": "img/190-Olmstead.jpg"
},
  {
   "address": "2510 Longwood Court",
    "city": "Titusville",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 1602,
    "price": "$425,000",
    "desc": "Check out this beautifully maintained 3 bedroom, 2 bath home with 2-car garage and screen enclosed pool. This home offers a roof done in 2021, hurricane shutters, hot water replaced in 2017 and has 9 1/2 ft ceilings throughout. If you work at the Space Center this house is only 14 miles to the industrial area of KSC. Close to shopping, I-95 and US-1. House also offers an extra driveway/RV pad behind the house with electric hookup.",
    "link": "https://www.flexmls.com/share/A3i4O/2510-Longwood-Court-Titusville-FL-32780",
    "image": "img/2510-Longwood.jpg"
},
   {
   "address": "3003 Sea Gate Circle",
    "city": "Merritt Island",
    "bedrooms": "2",
    "bathrooms": "2",
    "sqft": 1044,
    "price": "$299,000",
    "desc": " Great 2 Bedroom 2 Bath Duplex perfect for first time homebuyer. Brand New A/C & water heater, 2 years new roof, newer appliances Screened enclosed porch overlooks the fenced-backyard., Convenient location with quick & easy access to SR528 as well as KSC.",
    "link": "https://www.flexmls.com/share/A44IU/3003-Sea-Gate-Circle-Merritt-Island-FL-32953",
    "image": "img/3003-Sea-Gate.jpg"
},
  {
   "address": "1654 South Park Avenue",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "3",
    "sqft": 1332,
    "price": "$199,000",
    "desc": " Welcome to Tennis Village! This 2-bedroom 21/2-bathroom two story townhouse has community pool and tennis court along with lower-level courtyard, and 2nd level balcony. Inside you will find an open floor plan with eat in kitchen and breakfast bar, living room with wood burning fireplace, a half bath with laundry, and sliders to access the courtyard from the dining and living areas. The second floor you will find the master bedroom with ensuite bath, guest bedroom with the guest bath and nice storage space. Main roof installed 6/2020. All of this conveniently located near the Indian River Lagoon on the Space Coast with easy access to major highways, beaches, shopping and medical. Dont miss this great opportunity!",
    "link": "https://www.flexmls.com/share/A68nL/1654-S-Park-Avenue-Titusville-FL-32780",
    "image": "img/1654-Park.jpg"
  }
]

