[
  {
   "address": "3726 Neverland Drive",
    "city": "New Smyrna Beach",
    "bedrooms": "4",
    "bathrooms": "3",
    "sqft": 2681,
    "price": "$479,900",
    "desc": "This beautiful 4 bedroom, 2 full baths, 1 half bath home is located on a corner lot in the desirable Coastal Woods subdivision. On the main floor you will find the kitchen, dining room, bonus/flex room, living room, and half bath. On the second floor you will find four bedrooms, two full baths, the laundry room, attic access and a large loft. The master bath includes double sinks, a private toilet, shower, a large walk-in closet and a linen closet. The spare bath contains double sinks and a tub/shower. This home offers tile floors downstairs, pet and waterproof carpet upstairs (installed 2022), various automatic and dimmer lights downstairs, lots of storage space on both floors, kitchen with tiled back splash, walk-in pantry, and a large island. Home has a fresh air ventilation system (AprilAire Home). The backyard is fully fenced with white vinyl fencing which has a double gate on the south side. The backyard also contains a 50-amp generator hookup, a covered porch and an open area, both with pavers. The gazebo conveys as well! The HOA fee includes community maintenance, the community pool and playgrounds.",
    "link": "https://www.flexmls.com/share/ABRQe/2736-Neverland-Drive-New-Smyrna-Beach-FL-32168",
    "image": "img/2736-Neverland.jpg"
  },
   {
   "address": "817 Oakwood Drive",
    "city": "Melbourne",
    "bedrooms": "2",
    "bathrooms": "2",
    "sqft": 1842,
    "price": "$375,000",
    "desc": "Spacious one-story villa in the desirable Briarwood at Suntree, which offers a community pool with bathrooms, a water fountain, a covered patio, chase loungers and umbrellas. Being a resident, you are allowed to join Suntree's HOA (additional fees) that offers 36 holes of Championship golf, a state-of-the-art short game practice facility, 8 lighted tennis courts and a club house! Roof is 2 years new! You will enter this home through a large, tiled courtyard. This home has an open floor plan with two large bedrooms, two full bathrooms, a two-car garage, kitchen with a breakfast nook & plenty of cabinet and countertop space, an indoor laundry with plenty of cabinets for storage, living room, dining room & a family/florida room, multiple skylights that allow for natural light throughout, multiple storage closets, hurricane shutters & a sprinkler system. The large master bedroom has a walk-in closet & an additional closet.The master bathroom has a tub & separate shower, double sinks & a large linen closet. This home is located near shopping, dining, banking, healthcare, schools, entertainment, vehicle care & much more. HOA covers roof replacement, insurance, exterior maintenance, lake/irrigation maintenance, community pool, pest control & termite bond.",
    "link": "https://www.flexmls.com/share/ABReJ/817-Oakwood-Drive-Melbourne-FL-32940",
    "image": "img/817-Oakwood.jpg"
   },
    {
   "address": "3620 Buttonwood Drive",
    "city": "Titusville",
    "bedrooms": "4",
    "bathrooms": "3",
    "sqft": 1923,
    "price": "$410,000",
    "desc": "Beacon Hills tri-level with BASEMENT at the end of a cul-de-sac! This 4 bedroom 2.5 bathroom on almost 1/2 acre has endless possibilities! You will enter this home through the double door entry to find the living, dining and kitchen area. Upstairs will encompass the spacious master suite with his/hers closet, renovated bathroom with walk in shower, 2 guest bedrooms, renovated guest bathroom, and two storage closets. On the bottom floor you will find a private bedroom with ensuite half bath and sliders out to the patio. The two-car garage provides ample room for your cars, toys, and/or storage. Then as a bonus, there is a 400+ sq ft basement (not included on the tax roll) just waiting for some creative ideas for playroom, man cave, craft room, or whatever you may need extra space for. Back yard has chicken coop already in place so you can gather those fresh eggs! Newer roof and HVAC system. What are you waiting for, call now!",
    "link": "https://www.flexmls.com/share/AGN4f/3620-Buttonwood-Drive-Titusville-FL-32796",
    "image": "img/3620-Buttonwood.jpg"
   },
    {
   "address": "6485 Greenwood Avenue",
    "city": "Cocoa",
    "bedrooms": "2",
    "bathrooms": "2",
    "sqft": 1014,
    "price": "$265,000",
    "desc": "Watch the next rocket launch from your new backyard! This freshly painted 2 bedroom 2 bathroom home with additional bonus room is looking for its new owners. This floorplan features an eat-in kitchen, living room, enclosed Florida room, additional storage room under air, and wood flooring throughout. 1 car garage with laundry area & additional space. Nice sized fenced backyard equipped with 2 sheds for storage, 1 with electric. Washer/dryer, garage refrigerator, & mini refrigerator all convey. Roof 2015, AC 2018, and septic tank pumped last month. Don't miss your opportunity to take advantage of all this home has to offer!",
    "link": "https://www.flexmls.com/share/AGNKQ/6485-Greenwood-Avenue-Cocoa-FL-32927",
    "image": "img/6485-Greenwood.jpg"
   },
  {
   "address": "2580 Toups Trail",
    "city": "Titusville",
    "bedrooms": "3",
    "bathrooms": "2.5",
    "sqft": 1858,
    "price": "$517,928",
    "desc":  "This beautiful 3/2.5 pool home sits on 1+ acre nestled in a secluded private wooded sanctuary. Home features a whole house Onan generator, new carpet in the living room, fireplace, a heated 15X30 pool, completely screened in with a large porch. Master bedroom has access to the pool and has his and hers walk in closets. Spacious 3 car garage and a detached workshop/studio that can easily be converted to a guest /in-law suite.",
    "link": "https://www.flexmls.com/share/AGNoF/2580-Toups-Trail-Titusville-FL-32780",
    "image": "img/2580-Toups.jpg"
     },
    {
   "address": "2566 Christopher Drive",
    "city": "Titusville",
    "bedrooms": "4",
    "bathrooms": "2",
    "sqft": 2320,
    "price": "$529,900",
    "desc":  "Welcome to your Energy-Efficient Oasis - Spectacular, 4BR/2BA spacious, custom pool home nestled in a gated, quiet HOA community. This beautifully maintained home features an open floor plan with vaulted ceilings, and formal living and dining rooms. The large family room, adorned with a wood burning stone fireplace, is perfect for gatherings. The heart of the home boasts refinished kitchen cabinets (2021), granite countertops and a convenient walk-in pantry. Separate laundry room off kitchen and garage. A stunning heated in-ground swimming pool with jacuzzi makes this area your retreat from a long day. The pool patio has an extra-large screened-in lanai, with an outdoor kitchen, and a fenced in yard for privacy. Reclaimed water system waters yard and landscaping. Roof (12 yrs.), solar panels (3 yrs.), AC (new) and gas appliances (water and pool heater and stove/range). This home offers easy access to schools, shopping, dining, and entertainment.",
    "link": "https://www.flexmls.com/share/AKxzr/2566-Christopher-Drive-Titusville-FL-32780",
    "image": "img/2566-christopher.jpg"
     },
   {
   "address": "911 Tupelo Circle",
    "city": "Cocoa",
    "bedrooms": "4",
    "bathrooms": "2",
    "sqft": 1761,
    "price": "$355,000",
    "desc":  "Almost new 2022 built home in Hickory Ridge - owner hardly lived in the house due to traveling/working. A spacious 4 bedroom, 2 bath home with a 2 car garage. Entering the home from a covered porch area into the formal dining room with large windows. An open floor plan with 10' vaulted ceilings. Kitchen has an island & features 36'' all wood Cabinets w/crown molding, Moen faucets, stainless steel appliances & pantry. Large owner's suite with a large walk-in closet, separate shower, and garden tub. Fourth bedroom perfect for a Home Office with tons of light & home also includes a covered lanai. Taexx pest prevention system, double pane (low E) windows w/ Storm Shutters, and so much more. Energy Efficient w/ 10-year structural, builder and manufacturer warranties all included. Home is conveniently located to the Beachline to the airport & beaches or interstate. Close to medical, shopping, schools & restaurants.", 
    "link": "https://www.flexmls.com/share/ANimo/911-Tupelo-Circle-Cocoa-FL-32926",
    "image": "img/911-tupelo.jpg"
     },
      {
   "address": "0000 Central Parkway",
    "city": "Deland",
    "bedrooms": "0",
    "bathrooms": "0",
    "sqft": 22250,
    "price": "$70,000",
    "desc":  " Double lot on a corner available to build your new home in an up and coming community . 150 Feet of road frontage on 2 sides", 
    "link": "https://www.flexmls.com/share/ANn6E/0000-Central-Parkway-DeLand-FL-32724",
    "image": "img/0000-central.jpg"
     },
       {
   "address": "452 Cressa Circle",
    "city": "Cocoa",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 1957,
    "price": "$349,999",
    "desc":  "Location, Location, Location!! Welcome to Fern Meadows subdivision where you will find this nicely appointed split plan 3 bedroom 2 bath home. As you enter the foyer area there is a formal living and dining room that leads you into the kitchen and great room area. Spacious kitchen has stainless appliances, breakfast bar and built in office/homework nook. The great room has ceramic tile flooring and sliding shutters/door to screened in back patio. The master bedroom boasts a walk in shower, garden tub, and walk in closet. The guest bedrooms have a small den area between that can be used for play/sitting area. There is an Inside laundry/utility room, 2 car garage, and white vinyl privacy fenced back yard. Great location for commuting to all major highways, central Florida, beaches, and the Kennedy Space Center.", 
    "link": "https://www.flexmls.com/share/APEIg/452-Cressa-Circle-Cocoa-FL-32926",
    "image": "img/452-cressa.jpg"
     },  
      {
   "address": "6725 Caliph Ave",
    "city": "Cocoa",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 2311,
    "price": "$379,000",
    "desc":  "A MUST SEE! Sought after Half acre, corner lot in Port St John - Double Lot with very spacious back yard for all of your back yard entertainment needs or maybe add a large pool! This 4 bedroom, 2 1/2 bath home has a 2 car garage with a large screen porch to relax. Walking into the foyer, double glass doors open up to a formal living room and dining room. The master suite has 2 walk in closets, a jetted tub & separate shower and 2 sink areas. The kitchen has a bar area for stools and a small eat in area. A family room is also off the kitchen. # other bedrooms and a full bath are down another hallway. The back yard has a chain link fenced off area if you have pets. Close to Schools, medical, shopping & restaurants with easy access to the interstate", 
    "link": "https://www.flexmls.com/share/ARfyR/6725-Caliph-Avenue-Cocoa-FL-32927",
    "image": "img/6725-Caliph.jpg"
     },  
        {
   "address": "3455 Ayrshire Circle",
    "city": "Melbourne",
    "bedrooms": "5",
    "bathrooms": "5",
    "sqft": 2858,
    "price": "$888,500",
    "desc":  "Luxurious Waterfront Living! Assumable VA mortgage at 3.375% for those who qualify. Welcome to this beautiful, two-story, Grand Chateau by Viera Builders, located in the desirable gated community of Chelford. This barrel tiled home boasts 5 bedrooms, 4.5 bathrooms, and a 3-car garage. The screened-in lanai includes a gas heated, saltwater pool, spa and cabana half bath, which is the perfect area for entertaining family and friends. The Pentair pool and spa keypad controls are located inside the home. The gas line hookups in the lanai are convenient for grills or adding a summer kitchen. Upon entry, you will be welcomed into the living room with a custom-built, 18' stone masonry gas fireplace, a formal dining room with vaulted ceiling, kitchen with granite countertops and backsplash, stainless steel appliances, 4 burner gas cooktop, under cabinet lighting, large breakfast counter, and an eat-in kitchen area with custom-built cabinetry. The connecting family room has built-in shelving. One bedroom, one full bathroom (ideal for guests or as a mother-in-law suite) and the laundry room with additional storage complete this all tiled, first floor. The wooden staircase with iron balusters leads you to the second story which offers Acacia hardwood floors throughout. The large owner's suite has an impressive double door entry, huge walk-through closet and owner's ensuite bathroom with double sinks, vanity area, a large tub and separate shower. A second bedroom has its own ensuite full bathroom. The turret area can be used for a home office or play area. Two additional bedrooms with a full bathroom complete the upstairs. The lush, landscaped yard contains beautiful, mature palm trees, a fruit producing mango tree, and serene water views. The side yard is fenced-in with black aluminum fencing. All windows are double-paned and most have plantation shutters. Hurricane shutters for all main floor windows and sliding glass doors are included. This home also has a central vacuum system and a Taexx built-in pest control system! Manatee Elementary, Viera Charter School, Viera Middle School (projected opening August 2024) and Viera High School are only a golf cart ride away. Qualified buyers, call today for your private viewing!", 
    "link": "https://www.flexmls.com/share/AS5T8/3455-Ayrshire-Circle-Melbourne-FL-32940",
    "image": "img/3455-ayrshire.jpg"
     },  
      {
   "address": "4520 Apollo Road",
    "city": "Titusville",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 1104,
    "price": "$255,000",
    "desc":  " Great starter or retirement home! This concrete block 3-bedroom home is conveniently located within a short drive to beaches, space center, major highways, shopping and dining. Tesla solar package with whole house back up, insulated windows and water heater 2019, new sewer line from house to street, new impact rated front door, and private well w/sprinklers. Oversized car port, fenced yard, utility room, and exterior shed. Don't let this one pass you by!", 
    "link": "https://www.flexmls.com/share/AUWLi/4520-Apollo-Road-Titusville-FL-32780",
    "image": "img/4520-apollo.jpg"
     },
        {
   "address": "190 E. Olmstead Drive 1",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1",
    "sqft": 1054,
    "price": "$215,895",
    "desc":  "First of all, the VIEWS!! You can see the water from all windows. Watch dolphins, manatees and Rockets from your private front or back porch. Completely redone inside featuring: great room with East facing water views to catch the sunrise. Large working kitchen with tons of storage, granite countertops, high-end Samsung range, double sinks and breakfast bar. Tiled handicap shower, new (2022) double hung hurricane impact windows with custom fit blinds, external hurricane shutters, new (2023) water heater, A/C (2018), tile in public rooms, wood laminate floors in bedrooms, and lighted ceiling fans in all rooms. Community pool being resurfaced, enjoy the clubhouse and dock. Awesome view of the VAB from the dock. Close to all shopping, Orlando and Kennedy Space Center. The only thing missing is you.", 
    "link": "https://www.flexmls.com/share/AUWX2/190-E-Olmstead-Drive-1-Titusville-FL-32780",
    "image": "img/190-olmstead1.jpg"
     },  
       {
   "address": "2990 S. Fiske Boulevard 4",
    "city": "Rockledge",
    "bedrooms": "2",
    "bathrooms": "3",
    "sqft":  0,
    "price": "$239,000",
    "desc":  "Swiss Pointe Condo Community in Rockledge offers access to community pool and club house! A little extra privacy offered with this 2-story end unit condo that has 2 bedrooms, both with ensuite baths, and additional 1/2 bath for guest convenience. Enjoy the open floor plan with fresh interior paint and ceramic tile flooring. The spacious kitchen has eat-in breakfast nook, pantry, and breakfast bar that overlook dining/living area. Sliders lead out to screened porch and back yard area. Assocation amenities also includes grass mowing, exterior maintenance and roof.",
    "link": "https://www.flexmls.com/share/AZDFs/2990-S-Fiske-Boulevard-4-Rockledge-FL-32955",
    "image": "img/2990-Fiske.jpg"
     },
        {
   "address": "3570 Barna Ave",
    "city": "Titusville",
    "bedrooms": "4",
    "bathrooms": "2",
    "sqft": 1561,
    "price": "$288,994",
    "desc":  "Bring your toys, RV/boat, comfortable 4/2 home on .25 acre, centrally located. Living room, family room, currently used as a fourth bedroom with large walk-in closet, eat in kitchen, ceramic tile flooring throughout. Roof 2019, A/C 2017, new blown in insulation 2022, all cast iron plumbing removed, it is current PVC code, sprinkler system on well, 1 car garage, and fenced yard for privacy. The garden rich with two mango trees, avocado, banana, mandarin orange, blackberries, pineapple, cilantro, azalea, Easter lillies, Canna lillies, Robilini palms, live oak, royal oak, and bamboo. Close to I-95, US 1, shopping, schools, beaches, Orlando attractions, and rocket launches.", 
    "link": "https://www.flexmls.com/share/AZDJv/3570-Barna-Avenue-Titusville-FL-32780",
    "image": "img/3570-Barna.jpg"
     }  
]
