[
  {
    "address": "3426 Joe Murrel Drive",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1.1",
    "sqft": 1088,
    "price": "$99,999",
    "desc": "Investor Alert! Cash only sale. Don't miss your chance to turn this end unit townhouse back to a gem. 2 story 2 bedroom with Jack N Jill baths upstairs and a half bath downstairs. Screened patio with privacy fenced back yard. Ceramic tile flooring throughout ground floor. Roof needs replaced. Seller has never seen or occupied the property. Would make a great winter retreat, or rental property.",
    "link": "https://my.flexmls.com/SavannahBillow/search/shared_links/9LLpD/listings/20230928141151597796000000",
    "image": "img/joe-murrell.jpg"
  },
  {
    "address": "3565 Sable Palm Lane, E",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1",
    "sqft": 785,
    "price": "$149,900",
    "desc": "Villas at LaCita renovated 2nd floor condo with fireplace, brand new washer/dryer, and brand-new HVAC system. Galley kitchen has pantry and living room has slider to screened balcony with storage area. Community amenities include inground pool, tennis courts, fitness room, coined laundry, and picnic/BBQ area. Within minutes from watching rocket launches, the Indian River lagoon, shopping, and restaurants.",
    "link": "https://my.flexmls.com/SavannahBillow/search/shared_links/9CstW/listings/20230726162155820883000000",
    "image": "img/3565-sable-palm.jpeg"
  },
  {
 "address": "1680 Country Lane",
    "city": "Titusville",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 1332,
    "price": "$278,500",
    "desc": "Don't miss your chance on all these updates and renovations! New roof (11/2022) HVAC (2018) water heater (2021) and Square D electric panel. Concrete block 3 bedroom 2 bath home with spacious 2-car carport and storage room. Home was recently updated to include kitchen with stainless appliances and granite countertops, ceramic tile flooring throughout and renovated bathrooms. Indoor laundry/utility room with washer/dryer included. Screened porch with privacy 6ft vinyl fenced back yard. Central location just minutes to shopping, medical, and major highways. Watch rocket launches from your front yard!",
    "link": "https://www.flexmls.com/share/9Wc2y/1680-Country-Ln-Titusville-FL-32780",
    "image": "img/1680-Country-Ln.jpg"
  },
  {
    "address": "4829 Sisson Road",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1",
    "sqft": 1140,
    "price": "$182,500",
    "desc": " *** A Must See! *** This updated townhouse is centrally located to schools, shopping, medical & restaurants with easy access to 95. A long list of updates include: A new roof 2022, Updated Kitchen with new appliances and cabinets, New carpet upstairs, New fresh interior paint, all New Window Treatments, New European Wood Laminate Flooring in the living areas. A fenced courtyard for privacy for your outdoor activities and a great view of the rocket launches. A community pool to have some fun also.",
    "link": "https://www.flexmls.com/share/9WchO/4829-Sisson-Rd-Titusville-FL-32780",
    "image": "img/4829-Sisson-Rd.jpg"
   },
  {
     "address": "5989 Barna Avenue",
    "city": "Titusville",
    "bedrooms": "4",
    "bathrooms": "2",
    "sqft": 1974,
    "price": "$529,000",
    "desc": "Meticulously maintained 4 bedroom 2 bath home on .75 acre lot. Large outbuilding (18x40) with power. Solar heated screened salt water pool. Updated kitchen with stainless appliances, granite counter tops and pantry. Separate dining room, formal living room and also a den area. Master bedroom/bath has walk-in closet, soaking garden tub and double sinks. Ceramic tile flooring, recessed lighting and ceiling fans throughout. Private well with 10 zone sprinkler system and half circle driveway. Garage has extra enclosed room that would be great for office/storage area. Great location for commute to with major highways, beaches, and space center. Don't miss your chance to see this beauty!",
    "link": "https://www.flexmls.com/share/9Wcq0/5989-Barna-Ave-Titusville-FL-32780",
    "image": "img/5989-Barna-Ave.jpg"
  },
  {
  "address": "944 Brunswick Lane",
    "city": "Rockledge",
    "bedrooms": "4",
    "bathrooms": "2",
    "sqft": 2184,
    "price": "$359,900",
    "desc": " ***Must See!! *** This large home in Levitt Park is set within a well established neighborhood in Rockledge. This house has 4 spacious bedrooms, 2 baths and a 1 car garage. New roof 2021, new A/C 2021. New Gas Water Heater, a Generac generator and easy accordion storm shutters will also help during bad weather. Sit cozy by the flame in your fireplace that will bring comfort during the cold days or relax in your family room with a view of your private garden retreat- your fenced backyard. This home is close to schools, medical, restaurants and shopping with easy access to the interstate. A park with a pond is within walking distance for jogging, walks, a playground & picnic tables. Come by and take a look!",
    "link": "https://www.flexmls.com/share/9ZLXL/944-Brunswick-Ln-Rockledge-FL-32955",
    "image": "img/944-Brunswick.jpg"
  }
]

