[
  {
    "address": "3426 Joe Murrel Drive",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1.1",
    "sqft": 1088,
    "price": "$99,999",
    "desc": "Investor Alert! Cash only sale. Don't miss your chance to turn this end unit townhouse back to a gem. 2 story 2 bedroom with Jack N Jill baths upstairs and a half bath downstairs. Screened patio with privacy fenced back yard. Ceramic tile flooring throughout ground floor. Roof needs replaced. Seller has never seen or occupied the property. Would make a great winter retreat, or rental property.",
    "link": "https://my.flexmls.com/SavannahBillow/search/shared_links/9LLpD/listings/20230928141151597796000000",
    "image": "img/joe-murrell.jpg"
  },
  {
    "address": "3565 Sable Palm Lane, E",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1",
    "sqft": 785,
    "price": "$149,900",
    "desc": "Villas at LaCita renovated 2nd floor condo with fireplace, brand new washer/dryer, and brand-new HVAC system. Galley kitchen has pantry and living room has slider to screened balcony with storage area. Community amenities include inground pool, tennis courts, fitness room, coined laundry, and picnic/BBQ area. Within minutes from watching rocket launches, the Indian River lagoon, shopping, and restaurants.",
    "link": "https://my.flexmls.com/SavannahBillow/search/shared_links/9CstW/listings/20230726162155820883000000",
    "image": "img/3565-sable-palm.jpeg"
  },
  {
 "address": "1680 Country Lane",
    "city": "Titusville",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 1332,
    "price": "278,500",
    "desc": "Don't miss your chance on all these updates and renovations! New roof (11/2022) HVAC (2018) water heater (2021) and Square D electric panel. Concrete block 3 bedroom 2 bath home with spacious 2-car carport and storage room. Home was recently updated to include kitchen with stainless appliances and granite countertops, ceramic tile flooring throughout and renovated bathrooms. Indoor laundry/utility room with washer/dryer included. Screened porch with privacy 6ft vinyl fenced back yard. Central location just minutes to shopping, medical, and major highways. Watch rocket launches from your front yard!",
    "link": "https://www.flexmls.com/share/9Wc2y/1680-Country-Ln-Titusville-FL-32780",
    "image": "img/1680-Country-Ln.jpeg"
  }
]
