[
  {
 "address": "1680 Country Lane",
    "city": "Titusville",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 1332,
    "price": "$278,500",
    "desc": "Don't miss your chance on all these updates and renovations! New roof (11/2022) HVAC (2018) water heater (2021) and Square D electric panel. Concrete block 3 bedroom 2 bath home with spacious 2-car carport and storage room. Home was recently updated to include kitchen with stainless appliances and granite countertops, ceramic tile flooring throughout and renovated bathrooms. Indoor laundry/utility room with washer/dryer included. Screened porch with privacy 6ft vinyl fenced back yard. Central location just minutes to shopping, medical, and major highways. Watch rocket launches from your front yard!",
    "link": "https://www.flexmls.com/share/9tIAo/1680-Country-Lane-Titusville-FL-32780",
    "image": "img/1680-Country-Ln.jpg"
  },
  {
    "address": "4829 Sisson Road",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1",
    "sqft": 1140,
    "price": "$182,500",
    "desc": " *** A Must See! *** This updated townhouse is centrally located to schools, shopping, medical & restaurants with easy access to 95. A long list of updates include: A new roof 2022, Updated Kitchen with new appliances and cabinets, New carpet upstairs, New fresh interior paint, all New Window Treatments, New European Wood Laminate Flooring in the living areas. A fenced courtyard for privacy for your outdoor activities and a great view of the rocket launches. A community pool to have some fun also.",
    "link": "https://www.flexmls.com/share/9tIBZ/4829-Sisson-Road-Titusville-FL-32780",
    "image": "img/4829-Sisson-Rd.jpg"
   },
  {
   "address": "50 N. Mantor Avenue",
    "city": "Titusville",
    "bedrooms": "3",
    "bathrooms": "2",
    "sqft": 616,
    "price": "$119,000",
    "desc": "This mobile home offers 3 bedrooms, 1.5 bathrooms, kitchen, dining and living combo, a 15.4 (length) by 9.4 (width) enclosed porch and bonus room with double paned windows, a 39 (length) by 12.5 (width) carport, private laundry in an enclosed room off of the carport, a 15.5 (length) by 8.4 (width) wood deck on the south side of the home and a shed. The master bedroom offers a half bath and and built-in dresser. The second and third bedroom also have built-in dressers.",
    "link": "https://www.flexmls.com/share/9tICS/50-N-Mantor-Avenue-Titusville-FL-32796",
    "image": "img/50-mantor-aven.jpg"
  },
  {
     "address": "4875 Sisson Road",
    "city": "Titusville",
    "bedrooms": "2",
    "bathrooms": "1",
    "sqft": 1140,
    "price": "$170,000",
    "desc": " Recently Renovated 2 story 2 bed 11/2 bath townhouse with privacy fenced back yard area. Dining area, galley kitchen and living room along with 1/2 bath located on the first level. Kitchen has stainless appliances and granite countertops. Ceramic tile throughout downstairs, carpet throughout upstairs. 2nd level includes Master bedroom with his/hers closets, inside laundry hook up, guest bedroom and guest bath with Granite top. Community pool, lawn maintenance and basic cable included in the very low monthly assoc. fee. Roof 3 yrs, HVAC 1 year. Great location for easy commute to Kennedy Space Center, Orlando, and beaches. Just minutes to major highways.",
    "link": "https://www.flexmls.com/share/9szdZ/4875-Sisson-Road-Titusville-FL-32780",
    "image": "img/4875-Sisson-rd.jpg"

  }
]

